$(function () {
  gw_gb_index.init()

  // 18年34期前去掉pdf图标
  // 读取路径中当前期数
  var url = window.location.href;
  var index = url.lastIndexOf("\/");
  str = url.substring(0,index);
  var index1 = str.lastIndexOf("\/");
  str1 = url.substring(index1+1,index);
  var iss = str1.split('_')[1];
  if(iss<=7346){
    $(".gbpdf").css("display","none")
  }
})

var gw_gb_index = (function () {
  var qici = $("meta[name = lanmu]").attr("content").match(/\d+/g);
  var curYear = qici[0],curQici = qici[1];
  // var jsonUrl = 'http://www1.gov.cn/gongbao/trs_2018ceshi/index.json'
  var jsonUrl = '/gongbao/gbgl.json'
  var urlPdf = 'https://www.gov.cn/gongbao/shuju/'
  var issueObj = {}
  var dat = [
    ["1999", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36"],
    ["1998", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35"],
    ["1997", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40"],
    ["1996", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38"],
    ["1995", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33"],
    ["1994", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32"],
    ["1993", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31"],
    ["1992", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33"],
    ["1991", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46"],
    ["1990", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30"],
    ["1989", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28"],
    ["1988", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28"],
    ["1987", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30"],
    ["1986", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35"],
    ["1985", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36"],
    ["1984", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31"],
    ["1983", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26"],
    ["1982", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21"],
    ["1981", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27"],
    ["1980", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20"],
    ["1966", "--", "1", "2", "3", "4", "5"],
    ["1965", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16"],
    ["1964", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18"],
    ["1963", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24"],
    ["1962", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15"],
    ["1961", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19"],
    ["1960", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36"],
    ["1959", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30"],
    ["1958", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37"],
    ["1957", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48", "49", "50", "51", "52", "53", "54"],
    ["1956", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47"],
    ["1955", "--", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23"],
    ["1954", "--", "1", "2", "3"],
  ];


  function init() {
    getIssue(function(data){
      if(data==='500'){
        console.log('数据拉取错误')
      }else{
        issueObj = data[0].values
        issue()
      }
    })

  }
  /* 获取期号 */
  function getIssue(callback) {
    $.getJSON(jsonUrl, function (data) {
      if (data != null) {
        callback(data)
      } else {
        callback('500')
      }
    })
  }
  /**
   * 根据年遍历号
   * type===1 遍历2000年以后期号
   * type===2 遍历2000年以前期号
   */
  function renderByYear(year, type) {

    var numHtml = ''

    if (type === 1) {
      for (key in issueObj[year]) {
        if(!!/^第\d+号$/.test(key)){
          numHtml += '<li data-url="' + issueObj[year][key]['gname'] + '">' + issueObj[year][key]['issue'].replace(/\D+/g,'') + '号</li>'
        }
      }
    } else {

      for (var i = 0; i < dat.length; i++) {
        var tempUrl = ''

        for (var j = dat[i].length-1; j >=2; j--) {
          if (dat[i][0] === year.replace(/\D+/g,'')) {
            if (j > 1) {
              tempUrl = urlPdf + dat[i][0] + '/gwyb' + dat[i][0] + (Number(dat[i][j])<10 ? '0' : '') + dat[i][j] + '.pdf'
              numHtml += '<li data-url=' + tempUrl + '>' + dat[i][j] + '号</li>'
            }
            var l = dat[i].length;
            curQici = dat[i][l-1];
          }
        }
      }
    }

    $('#num p span').html(curQici + '号')
    $('#num ul').html(numHtml)

    // 最新一号未发布时
    if (gbDataNum == '0') {
      $("#num .items li").eq(0).hide()
    }
  }


  function goUrl(url) {
    if(url.indexOf('.pdf')>=0) {
      window.open(url);
    }else {
      window.location.href = url;
    }
  }
  function issue() {
    /* 渲染下拉菜单 */
    var yearHtml = ''

    //遍历2000年以后数据
    for (key in issueObj) {
      var a = Object.values(issueObj[key]);
      yearHtml += '<li data-url="' + a[0]['gname'] + '" data-last-url="' + a[a.length-1]['gname'] + '">' + key.replace(/\D+/g,'') + '年</li>'
    }
    //遍历2000年以前数据
    for (var i = 0; i < dat.length; i++) {
      var tempUrl = '',lastTempUrl = '',l = dat[i].length;
      tempUrl = urlPdf + dat[i][0] + '/gwyb' + dat[i][0] + (Number(dat[i][l-1]) < 10 ? '0' : '') + dat[i][l-1] + '.pdf'
      lastTempUrl = urlPdf + dat[i][0] + '/gwyb' + dat[i][0] + (Number(dat[i][2]) < 10 ? '0' : '') + dat[i][2] + '.pdf'
      yearHtml += '<li data-url="' + tempUrl + '" data-last-url="'+ lastTempUrl + '">' + dat[i][0] + '年</li>'
    }
    $('#year ul').html(yearHtml)
    $('#year p span').html(curYear + '年')
    renderByYear(curYear+'年', 1)

    /* 下拉菜单点击事件 */
    $('.selector').on('click', function (e) {
      $(this).find('.items').show();
      e ? e.stopPropagation() : event.cancelBubble = true;
    })
    $(window).on('click', function (e) {
      $('.selector .items').hide();
      e ? e.stopPropagation() : event.cancelBubble = true;
    })
    $('.items.year li').on('click', function (e) {
      var val = $(this).text()
      var url = $(this).attr('data-url')
      $(this).parent().hide().siblings('p').find('span').text(val)
      curYear = val.split('年')[0];

      //2000年前期号不跳转
      if (Number(curYear) < 2000) {
        renderByYear(curYear, 2)
      } else {
        goUrl(url);
      }

      e ? e.stopPropagation() : event.cancelBubble = true;
    })
    $('.items.num').on('click', 'li', function (e) {
      var val = $(this).text()
      var url = $(this).attr('data-url')
      $(this).parent().hide().siblings('p').find('span').text(val)
      curQici = val.split('号')[0];
      goUrl(url);
      e ? e.stopPropagation() : event.cancelBubble = true;
    })
    /* 上一号 */
    $('.first,.prev').on('click', function () {
      var numDom = $('#num ul li')
      var len = $('#num ul li').size()
      var curNum = $('#num p span').text()
      numDom.each(function (i) {
        if (curNum === $(this).text()) {
          var a = dat[dat.length-1];
          if (curYear <= a[0] && curQici <= a[2]) {
            alert('已经是首期!')
          } else {
            if (i === len - 1) {
              var t = $('#year p span').text();
              $('.items.year li').each(function(){
                if($(this).text() === t){
                  curYear = parseInt($(this).next().text());
                  $('#year p span').text(curYear+'年');
                  if(curYear >= 1954 && curYear <= 1999) {
                    renderByYear(curYear+'年', 2);
                  }
                  goUrl($(this).next().attr('data-url'));
                }
              })
            }else{
              curQici = parseInt($(this).next().text());
              $('#num p span').text(curQici+'号');
              goUrl($(this).next().attr('data-url'));
            }
          }
        }
      })
    })
    /* 下一号 */
    $('.last,.next').on('click', function () {
      var numDom = $('#num ul li')
      var len = $('#num ul li').size()
      var curNum = $('#num p span').text()
      //当前号dom 元素
      var curNumEle = numDom.filter(function(i,o){
        return $(o).text()===curNum
      })[0];
      //当前号 dom 元素的索引位置
      var curNumEleIndex = $(curNumEle).index();

      numDom.each(function (i) {
        if (curNum === $(this).text()) {
          var r = Object.keys(issueObj)[0],s = issueObj[r], t =Object.keys(s);

          if (parseInt(curYear) >= parseInt(r.replace(/\D+/g,'')) && parseInt(curQici) >= parseInt(t[0].replace(/\D+/g,''))) {
            alert('已经是最后一期!')
          } else {
            if (i === 0) {
              var t = $('#year p span').text();
              $('.items.year li').each(function(){
                if($(this).text() === t){
                  curYear = parseInt($(this).prev().text());
                  $('#year p span').text(curYear+'年');
                  if(curYear >= 1954 && curYear <= 1999) {
                    renderByYear(curYear+'年', 2);
                  }
                  curQici = parseInt($('#num ul li:last-child').text());
                  $('#num p span').text(curQici+'号');
                  goUrl($(this).prev().attr('data-last-url'));
                }
              })
            }else {
              curQici = parseInt($(this).prev().text());
              $('#num p span').text(curQici+'号');
              goUrl($(this).prev().attr('data-url'));
            }
          }
        }
      })
    })
  }
  return {
    init: init
  }
})()

