const historyData = {
  "01-01": [
    { "year": "1912", "title": "中华民国成立" },
    { "year": "1999", "title": "欧元正式启用" }
  ],
  "01-02": [
    { "year": "1905", "title": "日俄战争爆发" },
    { "year": "1923", "title": "《中国国民党党纲》公布" }
  ],
  "01-03": [
    { "year": "1521", "title": "麦哲伦抵达关岛" },
    { "year": "1989", "title": "长江葛洲坝水利枢纽工程竣工" }
  ],
  "01-04": [
    { "year": "1917", "title": "胡适发起文学改良运动" },
    { "year": "1948", "title": "缅甸独立" }
  ],
  "01-05": [
    { "year": "1919", "title": "纳粹党成立" },
    { "year": "1930", "title": "毛泽东撰写《星星之火，可以燎原》" }
  ],
  "01-06": [
    { "year": "1374", "title": "明朝《大明律》颁布" },
    { "year": "1941", "title": "皖南事变" }
  ],
  "01-07": [
    { "year": "1558", "title": "法国加来城沦陷" },
    { "year": "1933", "title": "中共临时中央迁入中央苏区" }
  ],
  "01-08": [
    { "year": "1902", "title": "梁启超创办《新民丛报》" },
    { "year": "1976", "title": "周恩来逝世" }
  ],
  "01-09": [
    { "year": "1283", "title": "文天祥就义" },
    { "year": "1946", "title": "中国代表参加远东委员会" }
  ],
  "01-10": [
    { "year": "1861", "title": "佛罗里达州宣布退出联邦" },
    { "year": "1946", "title": "第一届联合国大会第一期会议举行" }
  ],
  "01-11": [
    { "year": "1851", "title": "金田起义爆发" },
    { "year": "1947", "title": "刘胡兰就义" }
  ],
  "01-12": [
    { "year": "1791", "title": "大英博物馆对外开放" },
    { "year": "1920", "title": "土耳其废除素丹制" }
  ],
  "01-13": [
    { "year": "1908", "title": "中、英、德签订《津浦铁路借款合同》" },
    { "year": "1958", "title": "九千岁宫建成" }
  ],
  "01-14": [
    { "year": "1784", "title": "美国独立战争正式结束" },
    { "year": "1948", "title": "电影《一江春水向东流》创票房纪录" }
  ],
  "01-15": [
    { "year": "1809", "title": "蒲鲁东出生" },
    { "year": "1935", "title": "遵义会议召开" }
  ],
  "01-16": [
    { "year": "1581", "title": "荷兰独立" },
    { "year": "1981", "title": "我国第一座原子能反应堆改建成功" }
  ],
  "01-17": [
    { "year": "1908", "title": "慈禧太后立溥仪为帝" },
    { "year": "1945", "title": "瑞典外交官瓦伦堡失踪" }
  ],
  "01-18": [
    { "year": "1535", "title": "西班牙征服秘鲁" },
    { "year": "1919", "title": "巴黎和会召开" }
  ],
  "01-19": [
    { "year": "1853", "title": "凡尔登条约签订" },
    { "year": "1929", "title": "梁启超逝世" }
  ],
  "01-20": [
    { "year": "1924", "title": "第一次国共合作正式形成" },
    { "year": "1993", "title": "克林顿就任美国总统" }
  ],
  "01-21": [
    { "year": "1793", "title": "路易十六被处决" },
    { "year": "1924", "title": "列宁逝世" }
  ],
  "01-22": [
    { "year": "1901", "title": "英国维多利亚女王去世" },
    { "year": "1928", "title": "方志敏发动弋横起义" }
  ],
  "01-23": [
    { "year": "1368", "title": "朱元璋建立明朝" },
    { "year": "1967", "title": "中央文革小组夺取上海党政大权" }
  ],
  "01-24": [
    { "year": "1859", "title": "瓦拉几亚与摩尔达维亚联合" },
    { "year": "1984", "title": "中国首次研制成功南极考察站" }
  ],
  "01-25": [
    { "year": "1924", "title": "第一届冬奥会开幕" },
    { "year": "1956", "title": "《人民日报》创刊" }
  ],
  "01-26": [
    { "year": "1841", "title": "鸦片战争中英军占领香港" },
    { "year": "1953", "title": "美国解除对日本的占领" }
  ],
  "01-27": [
    { "year": "1842", "title": "德国作曲家韦伯逝世" },
    { "year": "1945", "title": "苏军解放奥斯威辛集中营" }
  ],
  "01-28": [
    { "year": "1596", "title": "英国探险家德雷克逝世" },
    { "year": "1986", "title": "美国挑战者号航天飞机失事" }
  ],
  "01-29": [
    { "year": "1856", "title": "英国维多利亚女王提出“欧洲协调”" },
    { "year": "1964", "title": "第一届全国人大第一次会议闭幕" }
  ],
  "01-30": [
    { "year": "1649", "title": "英国国王查理一世被处死" },
    { "year": "1933", "title": "希特勒被任命为德国总理" }
  ],
  "01-31": [
    { "year": "1916", "title": "袁世凯登基" },
    { "year": "1949", "title": "北平和平解放" }
  ],
  "02-01": [
    { "year": "1662", "title": "郑成功收复台湾" },
    { "year": "1946", "title": "印度尼西亚宣布独立" }
  ],
  "02-02": [
    { "year": "1907", "title": "俄国无产阶级政党建立" },
    { "year": "1971", "title": "我国第一座长波台建成" }
  ],
  "02-03": [
    { "year": "1873", "title": "美国发明家爱迪生发明留声机" },
    { "year": "1995", "title": "《中华人民共和国劳动法》正式施行" }
  ],
  "02-04": [
    { "year": "1861", "title": "美国南北战争爆发" },
    { "year": "1975", "title": "刘家峡水电站建成" }
  ],
  "02-05": [
    { "year": "1912", "title": "民国政府统一货币" },
    { "year": "1964", "title": "我国第一例自体肾移植手术成功" }
  ],
  "02-06": [
    { "year": "1908", "title": "上海首次试行有轨电车" },
    { "year": "1952", "title": "英国国王乔治六世逝世" }
  ],
  "02-07": [
    { "year": "1477", "title": "勃艮第战争结束" },
    { "year": "1974", "title": "我国海洋科学考察船首次出海" }
  ],
  "02-08": [
    { "year": "1902", "title": "梁启超在日本创办《新民丛报》" },
    { "year": "1979", "title": "中共中央批准为右派分子平反" }
  ],
  "02-09": [
    { "year": "1825", "title": "俄国十二月党人起义失败" },
    { "year": "1928", "title": "夏明翰就义" }
  ],
  "02-10": [
    { "year": "1763", "title": "巴黎和约签订，七年战争结束" },
    { "year": "1964", "title": "龙羊峡水电站开工" }
  ],
  "02-11": [
    { "year": "1878", "title": "《圣斯特凡诺条约》签订" },
    { "year": "1963", "title": "中央美术学院成立" }
  ],
  "02-12": [
    { "year": "1809", "title": "林肯出生" },
    { "year": "1912", "title": "清宣统皇帝溥仪宣布退位" }
  ],
  "02-13": [
    { "year": "1895", "title": "甲午战争清政府战败" },
    { "year": "1980", "title": "中国首次派团参加冬季奥运会" }
  ],
  "02-14": [
    { "year": "1876", "title": "亚历山大·格拉汉姆·贝尔申请电话专利" },
    { "year": "1912", "title": "聂耳出生" }
  ],
  "02-15": [
    { "year": "1564", "title": "伽利略出生" },
    { "year": "1904", "title": "华兴会成立" }
  ],
  "02-16": [
    { "year": "1910", "title": "同盟会分裂" },
    { "year": "1959", "title": "古巴革命胜利" }
  ],
  "02-17": [
    { "year": "1616", "title": "努尔哈赤建立后金" },
    { "year": "1963", "title": "迈克尔·乔丹出生" }
  ],
  "02-18": [
    { "year": "1294", "title": "元世祖忽必烈逝世" },
    { "year": "1861", "title": "意大利王国宣布成立" }
  ],
  "02-19": [
    { "year": "1473", "title": "哥白尼出生" },
    { "year": "2008", "title": "科索沃宣布独立" }
  ],
  "02-20": [
    { "year": "1881", "title": "奥地利作家卡夫卡出生" },
    { "year": "1985", "title": "我国首次南极科考凯旋" }
  ],
  "02-21": [
    { "year": "1848", "title": "《共产党宣言》出版" },
    { "year": "1972", "title": "美国总统尼克松访华" }
  ],
  "02-22": [
    { "year": "1732", "title": "华盛顿出生" },
    { "year": "1921", "title": "考茨基逝世" }
  ],
  "02-23": [
    { "year": "1868", "title": "美国通过宪法第14修正案" },
    { "year": "1940", "title": "杨靖宇壮烈牺牲" }
  ],
  "02-24": [
    { "year": "1881", "title": "沙俄强迫清政府签订《伊犁条约》" },
    { "year": "1991", "title": "海湾战争结束" }
  ],
  "02-25": [
    { "year": "1841", "title": "鸦片战争中清军反攻失败" },
    { "year": "1994", "title": "约旦与以色列建交" }
  ],
  "02-26": [
    { "year": "1808", "title": "法国进攻西班牙" },
    { "year": "1985", "title": "我国第一台大型电子显微镜研制成功" }
  ],
  "02-27": [
    { "year": "1844", "title": "多米尼加独立" },
    { "year": "1999", "title": "奥巴桑乔当选尼日利亚总统" }
  ],
  "02-28": [
    { "year": "1901", "title": "诺贝尔奖在巴黎首次颁发" },
    { "year": "1993", "title": "武陵源风景名胜区列入世界遗产" }
  ],
  "02-29": [
    { "year": "1936", "title": "雷诺汽车公司成立" },
    { "year": "2004", "title": "海地发生军事政变" }
  ],
  "03-01": [
    { "year": "1919", "title": "朝鲜三一运动爆发" },
    { "year": "1954", "title": "第一枚真正的氢弹试验成功" }
  ],
  "03-02": [
    { "year": "1836", "title": "得克萨斯独立" },
    { "year": "1969", "title": "协和式飞机首次试飞" }
  ],
  "03-03": [
    { "year": "1912", "title": "同盟会改组为国民党" },
    { "year": "1990", "title": "人类首次胜利横穿南极" }
  ],
  "03-04": [
    { "year": "1861", "title": "亚伯拉罕·林肯就任美国总统" },
    { "year": "1997", "title": "克林顿连任美国总统" }
  ],
  "03-05": [
    { "year": "1927", "title": "毛泽东考察湖南农民运动" },
    { "year": "1946", "title": "丘吉尔发表铁幕演说" }
  ],
  "03-06": [
    { "year": "1806", "title": "英国宣布禁止奴隶贸易" },
    { "year": "1987", "title": "我国首次颁发卫星运载火箭许可证" }
  ],
  "03-07": [
    { "year": "1876", "title": "俄国著名作家契诃夫出生" },
    { "year": "1965", "title": "美国黑人争取民权游行" }
  ],
  "03-08": [
    { "year": "1909", "title": "国际妇女节诞生" },
    { "year": "1952", "title": "我国第一次扫盲运动展开" }
  ],
  "03-09": [
    { "year": "1916", "title": "法德凡尔登战役爆发" },
    { "year": "1978", "title": "我国首次进行人工合成胰岛素" }
  ],
  "03-10": [
    { "year": "1876", "title": "贝尔发明电话" },
    { "year": "1918", "title": "苏俄首都由彼得格勒迁至莫斯科" }
  ],
  "03-11": [
    { "year": "1912", "title": "中华民国同盟会正式成立" },
    { "year": "1990", "title": "立陶宛独立" }
  ],
  "03-12": [
    { "year": "1881", "title": "土耳其国父凯末尔出生" },
    { "year": "1925", "title": "孙中山逝世" }
  ],
  "03-13": [
    { "year": "1868", "title": "日本明治维新开始" },
    { "year": "1930", "title": "美国科学家发现冥王星" }
  ],
  "03-14": [
    { "year": "1879", "title": "爱因斯坦出生" },
    { "year": "1997", "title": "重庆直辖市正式挂牌" }
  ],
  "03-15": [
    { "year": "1917", "title": "俄国二月革命爆发" },
    { "year": "1992", "title": "中国棋院成立" }
  ],
  "03-16": [
    { "year": "1908", "title": "诺贝尔物理学奖得主丁肇中出生" },
    { "year": "1988", "title": "《末代皇帝》获奥斯卡九项大奖" }
  ],
  "03-17": [
    { "year": "1861", "title": "意大利统一" },
    { "year": "1969", "title": "我国第一艘核潜艇下水" }
  ],
  "03-18": [
    { "year": "1871", "title": "巴黎公社革命爆发" },
    { "year": "1949", "title": "国民党退出大陆" }
  ],
  "03-19": [
    { "year": "1853", "title": "太平天国定都天京" },
    { "year": "1941", "title": "中国民主政团同盟成立" }
  ],
  "03-20": [
    { "year": "1727", "title": "牛顿逝世" },
    { "year": "1999", "title": "北约开始轰炸南联盟" }
  ],
  "03-21": [
    { "year": "1919", "title": "匈牙利苏维埃共和国成立" },
    { "year": "1955", "title": "我国首次发行新版人民币" }
  ],
  "03-22": [
    { "year": "1896", "title": "俄国波波夫发明无线电" },
    { "year": "1993", "title": "世界上第一只克隆羊多莉诞生" }
  ],
  "03-23": [
    { "year": "1882", "title": "德国细菌学家科赫发明结核菌素" },
    { "year": "1950", "title": "《世界人权宣言》发表" }
  ],
  "03-24": [
    { "year": "1603", "title": "英国女王伊丽莎白一世逝世" },
    { "year": "1980", "title": "中共中央决定废除干部领导职务终身制" }
  ],
  "03-25": [
    { "year": "1807", "title": "英国宣布终止奴隶贸易" },
    { "year": "1957", "title": "《罗马条约》签署，欧共体成立" }
  ],
  "03-26": [
    { "year": "1827", "title": "作曲家贝多芬逝世" },
    { "year": "1976", "title": "中国现代作家林语堂逝世" }
  ],
  "03-27": [
    { "year": "1946", "title": "国共达成东北停战协议" },
    { "year": "1981", "title": "中国现代文学家茅盾逝世" }
  ],
  "03-28": [
    { "year": "1854", "title": "英国与法国对俄国宣战，克里米亚战争爆发" },
    { "year": "1969", "title": "美国总统艾森豪威尔逝世" }
  ],
  "03-29": [
    { "year": "1904", "title": "《东方杂志》创刊" },
    { "year": "1974", "title": "陕西临潼发现兵马俑" }
  ],
  "03-30": [
    { "year": "1853", "title": "荷兰画家梵高出生" },
    { "year": "1949", "title": "《王子与贫儿》出版" }
  ],
  "03-31": [
    { "year": "1889", "title": "埃菲尔铁塔落成" },
    { "year": "1993", "title": "八届全国人大一次会议闭幕" }
  ],
  "04-01": [
    { "year": "1905", "title": "巴黎公社女英雄米歇尔逝世" },
    { "year": "1949", "title": "南京解放" }
  ],
  "04-02": [
    { "year": "1982", "title": "巴金获法国荣誉勋章" },
    { "year": "1983", "title": "我国第一颗同步通信卫星发射成功" }
  ],
  "04-03": [
    { "year": "1905", "title": "邹容逝世" },
    { "year": "1979", "title": "全国开始建立基层政权" }
  ],
  "04-04": [
    { "year": "1896", "title": "首届现代奥运会开幕" },
    { "year": "1949", "title": "中国新民主主义青年团成立" }
  ],
  "04-05": [
    { "year": "1815", "title": "荷兰独立" },
    { "year": "1959", "title": "我国第一座天文馆开馆" }
  ],
  "04-06": [
    { "year": "1892", "title": "美国飞机设计师波音出生" },
    { "year": "1984", "title": "中国居民身份证制度施行" }
  ],
  "04-07": [
    { "year": "1938", "title": "台儿庄会战大捷" },
    { "year": "1990", "title": "丹麦首次允许同性伴侣登记" }
  ],
  "04-08": [
    { "year": "1884", "title": "日本帝国宪法颁布" },
    { "year": "1946", "title": "国际联盟解散" }
  ],
  "04-09": [
    { "year": "1865", "title": "美国南北战争结束" },
    { "year": "1984", "title": "我国第一艘万吨级科学考察船下水" }
  ],
  "04-10": [
    { "year": "1790", "title": "美国通过专利法" },
    { "year": "1970", "title": "麦道公司与波音公司合并" }
  ],
  "04-11": [
    { "year": "1869", "title": "埃及开凿苏伊士运河" },
    { "year": "1997", "title": "英国驻港军全部撤离香港" }
  ],
  "04-12": [
    { "year": "1840", "title": "法国作家莫泊桑出生" },
    { "year": "1961", "title": "人类首次遨游太空" }
  ],
  "04-13": [
    { "year": "1906", "title": "《申报》创刊" },
    { "year": "1998", "title": "中国女队获尤伯杯冠军" }
  ],
  "04-14": [
    { "year": "1865", "title": "美国总统林肯遇刺" },
    { "year": "1931", "title": "西班牙第二共和国成立" }
  ],
  "04-15": [
    { "year": "1865", "title": "林肯逝世" },
    { "year": "1912", "title": "泰坦尼克号沉没" }
  ],
  "04-16": [
    { "year": "1889", "title": "英国历史学家汤因比出生" },
    { "year": "1945", "title": "苏军攻克柏林" }
  ],
  "04-17": [
    { "year": "1790", "title": "美国财政部长汉密尔顿创立美国银行" },
    { "year": "1998", "title": "我国科学家确认雅鲁藏布江大峡谷世界最深" }
  ],
  "04-18": [
    { "year": "1906", "title": "旧金山大地震" },
    { "year": "1955", "title": "爱因斯坦逝世" }
  ],
  "04-19": [
    { "year": "1775", "title": "美国独立战争爆发" },
    { "year": "1993", "title": "美国大卫教派据点被攻破" }
  ],
  "04-20": [
    { "year": "1945", "title": "美军解放达豪集中营" },
    { "year": "1999", "title": "中国摧毁最大走私集团" }
  ],
  "04-21": [
    { "year": "1910", "title": "作家马克·吐温逝世" },
    { "year": "1989", "title": "台湾开放大陆探亲" }
  ],
  "04-22": [
    { "year": "1870", "title": "俄国革命家列宁出生" },
    { "year": "1958", "title": "我国第一台小型电子计算机试制成功" }
  ],
  "04-23": [
    { "year": "1564", "title": "莎士比亚出生" },
    { "year": "1949", "title": "解放军渡江战役开始" }
  ],
  "04-24": [
    { "year": "1905", "title": "清廷废除科举制" },
    { "year": "1970", "title": "我国第一颗人造地球卫星发射成功" }
  ],
  "04-25": [
    { "year": "1886", "title": "法国作曲家德彪西出生" },
    { "year": "1945", "title": "盟军攻克柏林" }
  ],
  "04-26": [
    { "year": "1861", "title": "我国近代科学家詹天佑出生" },
    { "year": "1986", "title": "切尔诺贝利核事故" }
  ],
  "04-27": [
    { "year": "1656", "title": "荷兰画家伦勃朗逝世" },
    { "year": "1911", "title": "黄花岗起义爆发" }
  ],
  "04-28": [
    { "year": "1927", "title": "李大钊就义" },
    { "year": "1952", "title": "《日美安全保障条约》签订" }
  ],
  "04-29": [
    { "year": "1429", "title": "贞德解奥尔良之围" },
    { "year": "1991", "title": "世界第一斜拉桥杨浦大桥建成" }
  ],
  "04-30": [
    { "year": "1789", "title": "乔治·华盛顿就任美国总统" },
    { "year": "1975", "title": "越南战争结束" }
  ],
  "05-01": [
    { "year": "1886", "title": "美国芝加哥工人大罢工" },
    { "year": "1950", "title": "我国中央人民政府正式公布《婚姻法》" }
  ],
  "05-02": [
    { "year": "1895", "title": "《马关条约》换约" },
    { "year": "1997", "title": "英国工党上台执政" }
  ],
  "05-03": [
    { "year": "1928", "title": "日本物理学家汤川秀树出生" },
    { "year": "1994", "title": "世界首创转基因水稻在安徽问世" }
  ],
  "05-04": [
    { "year": "1919", "title": "五四运动爆发" },
    { "year": "1979", "title": "撒切尔夫人成为英国首位女首相" }
  ],
  "05-05": [
    { "year": "1818", "title": "马克思出生" },
    { "year": "1922", "title": "中国社会主义青年团成立" }
  ],
  "05-06": [
    { "year": "1856", "title": "奥地利心理学家弗洛伊德出生" },
    { "year": "1987", "title": "大兴安岭特大火灾" }
  ],
  "05-07": [
    { "year": "1840", "title": "俄国作曲家柴可夫斯基出生" },
    { "year": "1945", "title": "德国宣布无条件投降" }
  ],
  "05-08": [
    { "year": "1828", "title": "法国作家雨果出生" },
    { "year": "1945", "title": "欧洲反法西斯战争胜利结束" }
  ],
  "05-09": [
    { "year": "1904", "title": "我国最早的工科大学北洋大学成立" },
    { "year": "1950", "title": "我国新中国成立后的第一批大学生毕业" }
  ],
  "05-10": [
    { "year": "1871", "title": "法国凡尔赛军队攻入巴黎" },
    { "year": "1982", "title": "大陆首批赴台探亲团启程" }
  ],
  "05-11": [
    { "year": "1904", "title": "西班牙超现实主义画家达利出生" },
    { "year": "1950", "title": "我国与丹麦建交" }
  ],
  "05-12": [
    { "year": "1820", "title": "近代护理学创始人南丁格尔出生" },
    { "year": "2008", "title": "四川汶川大地震" }
  ],
  "05-13": [
    { "year": "1840", "title": "法国作家都德出生" },
    { "year": "1998", "title": "印尼发生大规模排华骚乱" }
  ],
  "05-14": [
    { "year": "1796", "title": "英国医生詹纳发明牛痘接种法" },
    { "year": "1984", "title": "我国首次进行洲际导弹全程试验" }
  ],
  "05-15": [
    { "year": "1859", "title": "法国科学家居里夫人出生" },
    { "year": "1949", "title": "解放军解放武汉" }
  ],
  "05-16": [
    { "year": "1804", "title": "拿破仑一世加冕为皇帝" },
    { "year": "1966", "title": "中共中央发布“五一六通知”" }
  ],
  "05-17": [
    { "year": "1792", "title": "纽约股票交易所正式成立" },
    { "year": "1995", "title": "波音公司与麦道公司合并" }
  ],
  "05-18": [
    { "year": "1872", "title": "英国著名哲学家罗素出生" },
    { "year": "1980", "title": "我国第一枚洲际导弹发射成功" }
  ],
  "05-19": [
    { "year": "1900", "title": "义和团运动爆发" },
    { "year": "1938", "title": "徐州沦陷" }
  ],
  "05-20": [
    { "year": "1806", "title": "英国占领好望角" },
    { "year": "1947", "title": "南京惨案" }
  ],
  "05-21": [
    { "year": "1871", "title": "法国巴黎公社失败" },
    { "year": "1951", "title": "《西藏和平解放协议》签订" }
  ],
  "05-22": [
    { "year": "1885", "title": "法国作家雨果逝世" },
    { "year": "1962", "title": "首届电影百花奖颁奖" }
  ],
  "05-23": [
    { "year": "1908", "title": "诺贝尔物理学奖得主劳伦斯出生" },
    { "year": "1951", "title": "西藏和平解放" }
  ],
  "05-24": [
    { "year": "1819", "title": "英国君主立宪制确立" },
    { "year": "1993", "title": "厄立特里亚独立" }
  ],
  "05-25": [
    { "year": "1870", "title": "爱尔兰爆发民族起义" },
    { "year": "1997", "title": "我国首批专家抵达香港" }
  ],
  "05-26": [
    { "year": "1805", "title": "法国军队占领罗马" },
    { "year": "1900", "title": "莫高窟藏经洞被发现" }
  ],
  "05-27": [
    { "year": "1878", "title": "美国现代舞创始人邓肯出生" },
    { "year": "1975", "title": "我国首次成功发射返回式卫星" }
  ],
  "05-28": [
    { "year": "1892", "title": "美国小说家海明威出生" },
    { "year": "1947", "title": "刘邓大军强渡黄河" }
  ],
  "05-29": [
    { "year": "1910", "title": "飞机首次飞越英吉利海峡" },
    { "year": "1953", "title": "人类首次登上珠穆朗玛峰" }
  ],
  "05-30": [
    { "year": "1832", "title": "法国巴黎共和党人起义" },
    { "year": "1925", "title": "五卅惨案爆发" }
  ],
  "05-31": [
    { "year": "1669", "title": "英国皇家海军击败荷兰海军" },
    { "year": "1931", "title": "我国第一辆国产汽车诞生" }
  ],
  "06-01": [
    { "year": "1904", "title": "青岛胶济铁路通车" },
    { "year": "1936", "title": "中国抗日红军大学成立" }
  ],
  "06-02": [
    { "year": "1839", "title": "林则徐虎门销烟" },
    { "year": "1946", "title": "意大利共和国成立" }
  ],
  "06-03": [
    { "year": "1839", "title": "虎门销烟开始" },
    { "year": "1920", "title": "中国共产党早期组织成立" }
  ],
  "06-04": [
    { "year": "1928", "title": "张作霖在皇姑屯被炸身亡" },
    { "year": "1940", "title": "英法军队敦刻尔克大撤退" }
  ],
  "06-05": [
    { "year": "1900", "title": "义和团反帝爱国运动爆发" },
    { "year": "1972", "title": "我国与希腊建交" }
  ],
  "06-06": [
    { "year": "1904", "title": "清末革命家秋瑾就义" },
    { "year": "1944", "title": "诺曼底登陆" }
  ],
  "06-07": [
    { "year": "1895", "title": "《马关条约》换约" },
    { "year": "1915", "title": "《中俄蒙协约》签订" }
  ],
  "06-08": [
    { "year": "1810", "title": "德国作曲家舒曼出生" },
    { "year": "1950", "title": "我国与缅甸建交" }
  ],
  "06-09": [
    { "year": "1870", "title": "英国作家狄更斯逝世" },
    { "year": "1991", "title": "皮纳图博火山爆发" }
  ],
  "06-10": [
    { "year": "1836", "title": "法国物理学家安培逝世" },
    { "year": "1907", "title": "孙中山领导潮州黄冈起义" }
  ],
  "06-11": [
    { "year": "1898", "title": "戊戌变法开始" },
    { "year": "1983", "title": "我国首次加入《南极条约》" }
  ],
  "06-12": [
    { "year": "1899", "title": "生物化学家李约瑟出生" },
    { "year": "1952", "title": "《毛泽东选集》出版" }
  ],
  "06-13": [
    { "year": "1897", "title": "芬兰作曲家西贝柳斯出生" },
    { "year": "1994", "title": "震惊世界的卢旺达大屠杀" }
  ],
  "06-14": [
    { "year": "1777", "title": "美国国旗正式制定" },
    { "year": "1919", "title": "蔡元培辞去北京大学校长职务" }
  ],
  "06-15": [
    { "year": "1843", "title": "英国作家王尔德出生" },
    { "year": "1949", "title": "解放军解放上海" }
  ],
  "06-16": [
    { "year": "1842", "title": "《中英南京条约》签订" },
    { "year": "1924", "title": "黄埔军校正式开学" }
  ],
  "06-17": [
    { "year": "1528", "title": "英国航海家德雷克出生" },
    { "year": "1972", "title": "尼克松与毛泽东举行历史性会谈" }
  ],
  "06-18": [
    { "year": "1815", "title": "滑铁卢战役爆发" },
    { "year": "1997", "title": "重庆直辖市正式成立" }
  ],
  "06-19": [
    { "year": "1623", "title": "法国数学家帕斯卡出生" },
    { "year": "1954", "title": "我国第一台电子数字计算机诞生" }
  ],
  "06-20": [
    { "year": "1898", "title": "戊戌变法失败" },
    { "year": "1960", "title": "塞内加尔独立" }
  ],
  "06-21": [
    { "year": "1852", "title": "法国作家莫泊桑出生" },
    { "year": "1900", "title": "八国联军攻占天津" }
  ],
  "06-22": [
    { "year": "1864", "title": "德国数学家希尔伯特出生" },
    { "year": "1941", "title": "德国进攻苏联" }
  ],
  "06-23": [
    { "year": "1894", "title": "甲午战争爆发" },
    { "year": "1961", "title": "《南极条约》生效" }
  ],
  "06-24": [
    { "year": "1828", "title": "法国作家福楼拜出生" },
    { "year": "1948", "title": "苏联封锁柏林" }
  ],
  "06-25": [
    { "year": "1863", "title": "太平天国将领石达开就义" },
    { "year": "1950", "title": "朝鲜战争爆发" }
  ],
  "06-26": [
    { "year": "1797", "title": "法国作家巴尔扎克出生" },
    { "year": "1945", "title": "联合国宪章签署" }
  ],
  "06-27": [
    { "year": "1858", "title": "《中法天津条约》签订" },
    { "year": "1970", "title": "我国第一台万吨水压机试制成功" }
  ],
  "06-28": [
    { "year": "1914", "title": "萨拉热窝事件" },
    { "year": "1919", "title": "《凡尔赛和约》签订" }
  ],
  "06-29": [
    { "year": "1900", "title": "意大利物理学家费米出生" },
    { "year": "1965", "title": "美军首次在越南使用B-52轰炸机" }
  ],
  "06-30": [
    { "year": "1908", "title": "俄国物理学家朗道出生" },
    { "year": "1949", "title": "解放军解放湖南" }
  ],
  "07-01": [
    { "year": "1917", "title": "张勋复辟" },
    { "year": "1921", "title": "中国共产党成立" }
  ],
  "07-02": [
    { "year": "1885", "title": "法国侵略军进攻台湾" },
    { "year": "1964", "title": "非洲统一组织成立" }
  ],
  "07-03": [
    { "year": "1844", "title": "《中美望厦条约》签订" },
    { "year": "1962", "title": "阿尔及利亚独立" }
  ],
  "07-04": [
    { "year": "1776", "title": "美国独立" },
    { "year": "1904", "title": "我国第一份官办日报《北洋官报》创刊" }
  ],
  "07-05": [
    { "year": "1857", "title": "法国作家小仲马出生" },
    { "year": "1948", "title": "北平发生“七·五”惨案" }
  ],
  "07-06": [
    { "year": "1415", "title": "捷克宗教改革家胡斯被处死" },
    { "year": "1934", "title": "中国工农红军北上抗日" }
  ],
  "07-07": [
    { "year": "1937", "title": "卢沟桥事变，全面抗战爆发" },
    { "year": "1981", "title": "美国太阳能飞机首次试飞" }
  ],
  "07-08": [
    { "year": "1859", "title": "挪威剧作家易卜生出生" },
    { "year": "1986", "title": "我国第一台洲际弹道导弹发射成功" }
  ],
  "07-09": [
    { "year": "1816", "title": "阿根廷独立" },
    { "year": "1926", "title": "北伐战争开始" }
  ],
  "07-10": [
    { "year": "1856", "title": "奥地利作家茨威格出生" },
    { "year": "1940", "title": "法国投降" }
  ],
  "07-11": [
    { "year": "1899", "title": "日本作家川端康成出生" },
    { "year": "1961", "title": "《中朝友好合作互助条约》签订" }
  ],
  "07-12": [
    { "year": "1817", "title": "美国作家梭罗出生" },
    { "year": "1927", "title": "蒋介石宣布“清党”" }
  ],
  "07-13": [
    { "year": "1895", "title": "捷克音乐家德沃夏克逝世" },
    { "year": "1956", "title": "我国第一批解放牌汽车试制成功" }
  ],
  "07-14": [
    { "year": "1789", "title": "法国大革命爆发" },
    { "year": "1987", "title": "台湾地区宣布解除戒严" }
  ],
  "07-15": [
    { "year": "1606", "title": "荷兰画家伦勃朗出生" },
    { "year": "1946", "title": "《中美友好通商航海条约》签订" }
  ],
  "07-16": [
    { "year": "1900", "title": "八国联军攻陷北京" },
    { "year": "1945", "title": "第一颗原子弹爆炸成功" }
  ],
  "07-17": [
    { "year": "1900", "title": "沙俄血洗江东六十四屯" },
    { "year": "1981", "title": "美国首架航天飞机试飞成功" }
  ],
  "07-18": [
    { "year": "1853", "title": "美国海军叩关日本" },
    { "year": "1955", "title": "第一座迪斯尼乐园开园" }
  ],
  "07-19": [
    { "year": "1834", "title": "法国作家埃德加·爱伦·坡出生" },
    { "year": "1905", "title": "斯大林成为苏共领袖" }
  ],
  "07-20": [
    { "year": "1969", "title": "人类首次登上月球" },
    { "year": "1973", "title": "法国在南太平洋进行核试验" }
  ],
  "07-21": [
    { "year": "1899", "title": "美国作家海明威出生" },
    { "year": "1928", "title": "井冈山会师" }
  ],
  "07-22": [
    { "year": "1822", "title": "孟德尔出生" },
    { "year": "1946", "title": "耶路撒冷分治" }
  ],
  "07-23": [
    { "year": "1888", "title": "美国作家杰克·伦敦出生" },
    { "year": "1921", "title": "中国共产党第一次全国代表大会召开" }
  ],
  "07-24": [
    { "year": "1783", "title": "拉丁美洲独立战争爆发" },
    { "year": "1982", "title": "我国与美国合作进行卫星发射" }
  ],
  "07-25": [
    { "year": "1869", "title": "格林童话作者威廉·格林逝世" },
    { "year": "1984", "title": "中国第一座现代化露天煤矿建成" }
  ],
  "07-26": [
    { "year": "1788", "title": "纽约成为美国第11个州" },
    { "year": "1953", "title": "埃及推翻法鲁克王朝" }
  ],
  "07-27": [
    { "year": "1953", "title": "朝鲜停战协定签订" },
    { "year": "1958", "title": "上海江南造船厂造出第一艘万吨轮" }
  ],
  "07-28": [
    { "year": "1914", "title": "第一次世界大战爆发" },
    { "year": "1976", "title": "唐山大地震" }
  ],
  "07-29": [
    { "year": "1836", "title": "法国巴黎凯旋门建成" },
    { "year": "1984", "title": "中国第二汽车制造厂建成投产" }
  ],
  "07-30": [
    { "year": "1862", "title": "美国政治家林肯颁布《解放黑人奴隶宣言》" },
    { "year": "1971", "title": "中国与秘鲁建交" }
  ],
  "07-31": [
    { "year": "1703", "title": "英国作家笛福《鲁滨逊漂流记》出版" },
    { "year": "1950", "title": "中国人民解放军福建前线司令部宣告成立" }
  ],
  "08-01": [
    { "year": "1927", "title": "南昌起义" },
    { "year": "1923", "title": "英国议会通过《妇女选举权法案》" }
  ],
  "08-02": [
    { "year": "1934", "title": "希特勒成为德国国家元首" },
    { "year": "1990", "title": "中国与沙特阿拉伯建交" }
  ],
  "08-03": [
    { "year": "1492", "title": "哥伦布出发远航" },
    { "year": "1923", "title": "鲁迅出版《呐喊》" }
  ],
  "08-04": [
    { "year": "1792", "title": "法国大革命推翻君主制" },
    { "year": "1931", "title": "中国第三次反围剿战争开始" }
  ],
  "08-05": [
    { "year": "1884", "title": "法国舰队进攻台湾基隆" },
    { "year": "1944", "title": "八路军发动百团大战" }
  ],
  "08-06": [
    { "year": "1945", "title": "美国向广岛投下原子弹" },
    { "year": "1890", "title": "挪威作曲家格里格逝世" }
  ],
  "08-07": [
    { "year": "1927", "title": "八七会议召开" },
    { "year": "1947", "title": "刘邓大军挺进大别山" }
  ],
  "08-08": [
    { "year": "1945", "title": "苏联对日宣战" },
    { "year": "2008", "title": "北京奥运会开幕" }
  ],
  "08-09": [
    { "year": "1945", "title": "美国向长崎投下原子弹" },
    { "year": "1978", "title": "中国与利比亚建交" }
  ],
  "08-10": [
    { "year": "1809", "title": "厄瓜多尔独立" },
    { "year": "1945", "title": "日本宣布无条件投降" }
  ],
  "08-11": [
    { "year": "1919", "title": "《凡尔赛和约》生效" },
    { "year": "1945", "title": "八路军发动全面反攻" }
  ],
  "08-12": [
    { "year": "1877", "title": "美国发明家爱迪生发明留声机" },
    { "year": "1948", "title": "朱自清病逝" }
  ],
  "08-13": [
    { "year": "1937", "title": "淞沪会战爆发" },
    { "year": "1961", "title": "东德修建柏林墙" }
  ],
  "08-14": [
    { "year": "1900", "title": "八国联军攻入北京" },
    { "year": "1945", "title": "日本正式接受《波茨坦公告》" }
  ],
  "08-15": [
    { "year": "1945", "title": "日本宣布无条件投降" },
    { "year": "1962", "title": "雷锋因公殉职" }
  ],
  "08-16": [
    { "year": "1845", "title": "法国物理学家勒纳出生" },
    { "year": "1960", "title": "塞浦路斯独立" }
  ],
  "08-17": [
    { "year": "1877", "title": "左宗棠率清军收复新疆" },
    { "year": "1945", "title": "汪精卫病亡" }
  ],
  "08-18": [
    { "year": "1925", "title": "省港大罢工爆发" },
    { "year": "1966", "title": "红卫兵运动兴起" }
  ],
  "08-19": [
    { "year": "1942", "title": "斯大林格勒战役爆发" },
    { "year": "1991", "title": "苏联八一九事件" }
  ],
  "08-20": [
    { "year": "1940", "title": "百团大战打响" },
    { "year": "1990", "title": "中国第一条高速公路沈大高速通车" }
  ],
  "08-21": [
    { "year": "1140", "title": "岳飞郾城大捷" },
    { "year": "1911", "title": "巴黎和会签订对奥和约" }
  ],
  "08-22": [
    { "year": "1642", "title": "荷兰航海家塔斯曼发现新西兰" },
    { "year": "1910", "title": "日本吞并朝鲜" }
  ],
  "08-23": [
    { "year": "1920", "title": "陈独秀组建上海共产主义小组" },
    { "year": "1958", "title": "中国人民解放军炮轰金门" }
  ],
  "08-24": [
    { "year": "1860", "title": "英法联军火烧圆明园" },
    { "year": "1966", "title": "中国首次导弹核武器试验成功" }
  ],
  "08-25": [
    { "year": "1667", "title": "荷兰攻占纽约" },
    { "year": "1912", "title": "中国国民党宣告成立" }
  ],
  "08-26": [
    { "year": "1789", "title": "法国颁布《人权宣言》" },
    { "year": "1980", "title": "中国成功发射第一颗洲际导弹" }
  ],
  "08-27": [
    { "year": "1770", "title": "德国哲学家黑格尔出生" },
    { "year": "1910", "title": "爱迪生发明有声电影" }
  ],
  "08-28": [
    { "year": "1828", "title": "俄国作家托尔斯泰出生" },
    { "year": "1945", "title": "重庆谈判开始" }
  ],
  "08-29": [
    { "year": "1842", "title": "《南京条约》签订" },
    { "year": "1958", "title": "中国第一座原子反应堆投入运行" }
  ],
  "08-30": [
    { "year": "1871", "title": "英国物理学家卢瑟福出生" },
    { "year": "1945", "title": "中国初步解放华南地区" }
  ],
  "08-31": [
    { "year": "1941", "title": "纳粹德国合围基辅" },
    { "year": "1957", "title": "马来西亚独立" }
  ],
  "09-01": [
    { "year": "1939", "title": "第二次世界大战全面爆发" },
    { "year": "1948", "title": "华北人民政府成立" }
  ],
  "09-02": [
    { "year": "1945", "title": "日本正式签署投降书" },
    { "year": "1958", "title": "中央电视台正式开播" }
  ],
  "09-03": [
    { "year": "1875", "title": "法国作家凡尔纳《神秘岛》出版" },
    { "year": "1943", "title": "意大利向盟国投降" }
  ],
  "09-04": [
    { "year": "1905", "title": "复旦公学开学" },
    { "year": "1995", "title": "第四次世界妇女大会在北京召开" }
  ],
  "09-05": [
    { "year": "1901", "title": "《辛丑条约》签订" },
    { "year": "1972", "title": "慕尼黑奥运会惨案" }
  ],
  "09-06": [
    { "year": "1899", "title": "美国作家海明威出生" },
    { "year": "1945", "title": "毛泽东赴重庆谈判" }
  ],
  "09-07": [
    { "year": "1822", "title": "巴西宣布独立" },
    { "year": "1901", "title": "八国联军攻占北京" }
  ],
  "09-08": [
    { "year": "1943", "title": "斯大林格勒战役胜利" },
    { "year": "1951", "title": "中国第一部《毛泽东选集》出版" }
  ],
  "09-09": [
    { "year": "1828", "title": "俄国作家契诃夫出生" },
    { "year": "1976", "title": "毛泽东逝世" }
  ],
  "09-10": [
    { "year": "1896", "title": "新四军军部成立" },
    { "year": "1945", "title": "上党战役打响" }
  ],
  "09-11": [
    { "year": "1862", "title": "美国南北战争联邦军胜利" },
    { "year": "1983", "title": "中国引滦入津工程建成通水" }
  ],
  "09-12": [
    { "year": "1916", "title": "凡尔登战役结束" },
    { "year": "1953", "title": "中国与柬埔寨建交" }
  ],
  "09-13": [
    { "year": "1922", "title": "中国共产党中央机关创刊《向导》" },
    { "year": "1959", "title": "新中国第一届全运会在北京举行" }
  ],
  "09-14": [
    { "year": "1836", "title": "西班牙革命爆发" },
    { "year": "1922", "title": "安源路矿工人大罢工" }
  ],
  "09-15": [
    { "year": "1916", "title": "坦克在索姆河战役首次使用" },
    { "year": "1954", "title": "全国人大一届一次会议召开" }
  ],
  "09-16": [
    { "year": "1810", "title": "墨西哥独立战争爆发" },
    { "year": "1932", "title": "《申报》创刊" }
  ],
  "09-17": [
    { "year": "1894", "title": "中日甲午战争爆发" },
    { "year": "1988", "title": "第24届汉城奥运会开幕" }
  ],
  "09-18": [
    { "year": "1931", "title": "九一八事变" },
    { "year": "1987", "title": "美国与苏联签署中导条约" }
  ],
  "09-19": [
    { "year": "1932", "title": "柳江战役红军大捷" },
    { "year": "1997", "title": "中国首次派维和部队赴国外" }
  ],
  "09-20": [
    { "year": "1870", "title": "意大利攻占罗马" },
    { "year": "1946", "title": "法国举行首届战后总统选举" }
  ],
  "09-21": [
    { "year": "1898", "title": "慈禧发动戊戌政变" },
    { "year": "1949", "title": "中国人民政治协商会议第一届全体会议召开" }
  ],
  "09-22": [
    { "year": "1862", "title": "林肯发表《解放宣言》" },
    { "year": "1990", "title": "中国与沙特阿拉伯建交" }
  ],
  "09-23": [
    { "year": "1846", "title": "法国天文学家勒维耶发现海王星" },
    { "year": "1969", "title": "中国成功进行首次地下核试验" }
  ],
  "09-24": [
    { "year": "1896", "title": "日本作家川端康成出生" },
    { "year": "1948", "title": "中共中央机关进驻西柏坡" }
  ],
  "09-25": [
    { "year": "1937", "title": "平型关大捷" },
    { "year": "1949", "title": "新疆和平解放" }
  ],
  "09-26": [
    { "year": "1849", "title": "巴甫洛夫出生" },
    { "year": "1980", "title": "中国成立特别法庭审判林彪、江青集团" }
  ],
  "09-27": [
    { "year": "1940", "title": "百团大战结束" },
    { "year": "1955", "title": "中国首次授衔授勋仪式" }
  ],
  "09-28": [
    { "year": "1864", "title": "太平天国天京陷落" },
    { "year": "1928", "title": "东北易帜" }
  ],
  "09-29": [
    { "year": "1901", "title": "意大利科学家费米出生" },
    { "year": "1951", "title": "中国第一辆解放牌汽车试制成功" }
  ],
  "09-30": [
    { "year": "1938", "title": "慕尼黑协定签订" },
    { "year": "1949", "title": "中国人民政治协商会议闭幕" }
  ],
  "10-01": [
    { "year": "1949", "title": "中华人民共和国成立" },
    { "year": "1910", "title": "清朝废除科举制度" }
  ],
  "10-02": [
    { "year": "1909", "title": "京张铁路通车" },
    { "year": "1949", "title": "中国与苏联建交" }
  ],
  "10-03": [
    { "year": "1877", "title": "左宗棠收复新疆" },
    { "year": "1990", "title": "中国与新加坡建交" }
  ],
  "10-04": [
    { "year": "1957", "title": "苏联发射第一颗人造地球卫星" },
    { "year": "1949", "title": "中国与保加利亚建交" }
  ],
  "10-05": [
    { "year": "1908", "title": "保加利亚独立" },
    { "year": "1948", "title": "太原解放" }
  ],
  "10-06": [
    { "year": "1927", "title": "井冈山革命根据地建立" },
    { "year": "1981", "title": "埃及总统萨达特遇刺" }
  ],
  "10-07": [
    { "year": "1860", "title": "英法联军火烧圆明园" },
    { "year": "1949", "title": "中国与波兰建交" }
  ],
  "10-08": [
    { "year": "1856", "title": "英国制造亚罗号事件" },
    { "year": "1950", "title": "中国人民志愿军入朝参战" }
  ],
  "10-09": [
    { "year": "1936", "title": "红军胜利结束长征" },
    { "year": "1985", "title": "中国第一座太阳能光电站建成" }
  ],
  "10-10": [
    { "year": "1911", "title": "辛亥革命爆发" },
    { "year": "1945", "title": "中共中央进驻延安" }
  ],
  "10-11": [
    { "year": "1889", "title": "日本第一部宪法颁布" },
    { "year": "1911", "title": "广州起义爆发" }
  ],
  "10-12": [
    { "year": "1492", "title": "哥伦布发现美洲大陆" },
    { "year": "1952", "title": "中国与蒙古建交" }
  ],
  "10-13": [
    { "year": "1884", "title": "中法战争爆发" },
    { "year": "1949", "title": "中国与朝鲜建交" }
  ],
  "10-14": [
    { "year": "1902", "title": "京师大学堂正式招生" },
    { "year": "1951", "title": "中国与巴基斯坦建交" }
  ],
  "10-15": [
    { "year": "1917", "title": "北京大学开始招收女生" },
    { "year": "1948", "title": "辽沈战役打响" }
  ],
  "10-16": [
    { "year": "1964", "title": "中国第一颗原子弹爆炸成功" },
    { "year": "1859", "title": "约翰·布朗起义" }
  ],
  "10-17": [
    { "year": "1849", "title": "湖南邵阳雷再浩起义" },
    { "year": "1967", "title": "中国第一颗氢弹试验成功" }
  ],
  "10-18": [
    { "year": "1851", "title": "金田起义爆发" },
    { "year": "1963", "title": "中国与肯尼亚建交" }
  ],
  "10-19": [
    { "year": "1893", "title": "中国革命家方志敏出生" },
    { "year": "1950", "title": "志愿军首战告捷" }
  ],
  "10-20": [
    { "year": "1923", "title": "中国社会主义青年团成立" },
    { "year": "1962", "title": "中印边境自卫反击战" }
  ],
  "10-21": [
    { "year": "1833", "title": "瑞典化学家诺贝尔出生" },
    { "year": "1967", "title": "中国第一颗人造卫星发射成功" }
  ],
  "10-22": [
    { "year": "1811", "title": "匈牙利革命家科苏特出生" },
    { "year": "1962", "title": "古巴导弹危机爆发" }
  ],
  "10-23": [
    { "year": "1880", "title": "西班牙独立" },
    { "year": "1923", "title": "德国啤酒馆政变" }
  ],
  "10-24": [
    { "year": "1945", "title": "联合国正式成立" },
    { "year": "1931", "title": "红军长征开始" }
  ],
  "10-25": [
    { "year": "1945", "title": "台湾光复" },
    { "year": "1950", "title": "中国人民志愿军跨过鸭绿江" }
  ],
  "10-26": [
    { "year": "1863", "title": "太平天国运动失败" },
    { "year": "1955", "title": "中国与阿富汗建交" }
  ],
  "10-27": [
    { "year": "1858", "title": "美国政治家西奥多·罗斯福出生" },
    { "year": "1948", "title": "辽沈战役胜利结束" }
  ],
  "10-28": [
    { "year": "1818", "title": "俄国作家屠格涅夫出生" },
    { "year": "1945", "title": "中国收复台湾" }
  ],
  "10-29": [
    { "year": "1911", "title": "武昌起义胜利" },
    { "year": "1956", "title": "苏伊士运河战争爆发" }
  ],
  "10-30": [
    { "year": "1896", "title": "俄国革命家托洛茨基出生" },
    { "year": "1961", "title": "苏联爆炸世界上最大氢弹" }
  ],
  "10-31": [
    { "year": "1887", "title": "中国革命家蒋介石出生" },
    { "year": "1984", "title": "中国第一支南极考察队出发" }
  ],
  "11-01": [
    { "year": "1949", "title": "中国科学院成立" },
    { "year": "1919", "title": "美国历史上第一次红色恐慌" }
  ],
  "11-02": [
    { "year": "1917", "title": "贝尔福宣言发表" },
    { "year": "1957", "title": "中国万吨巨轮跃进号下水" }
  ],
  "11-03": [
    { "year": "1839", "title": "林则徐虎门销烟" },
    { "year": "1957", "title": "苏联发射第二颗人造卫星" }
  ],
  "11-04": [
    { "year": "1918", "title": "第一次世界大战结束" },
    { "year": "1956", "title": "匈牙利事件爆发" }
  ],
  "11-05": [
    { "year": "1905", "title": "沙皇俄国军队在对马海峡战败" },
    { "year": "1913", "title": "中国同盟会改组为国民党" }
  ],
  "11-06": [
    { "year": "1917", "title": "俄国十月革命爆发" },
    { "year": "1937", "title": "太原会战结束" }
  ],
  "11-07": [
    { "year": "1917", "title": "十月革命胜利" },
    { "year": "1931", "title": "中华苏维埃共和国成立" }
  ],
  "11-08": [
    { "year": "1895", "title": "德国物理学家伦琴发现X射线" },
    { "year": "1923", "title": "希特勒发动啤酒馆暴动" }
  ],
  "11-09": [
    { "year": "1918", "title": "德国十一月革命爆发" },
    { "year": "1989", "title": "柏林墙倒塌" }
  ],
  "11-10": [
    { "year": "1894", "title": "甲午战争旅顺大屠杀" },
    { "year": "1945", "title": "中国民主同盟成立" }
  ],
  "11-11": [
    { "year": "1918", "title": "第一次世界大战停战" },
    { "year": "1949", "title": "中国人民解放军空军成立" }
  ],
  "11-12": [
    { "year": "1921", "title": "华盛顿会议召开" },
    { "year": "1947", "title": "台湾二二八起义" }
  ],
  "11-13": [
    { "year": "1907", "title": "世界上第一架直升机试飞" },
    { "year": "1984", "title": "中国第一支南极考察队抵达南极洲" }
  ],
  "11-14": [
    { "year": "1860", "title": "《北京条约》签订" },
    { "year": "1930", "title": "红军第一次反围剿" }
  ],
  "11-15": [
    { "year": "1862", "title": "林肯颁布《解放宣言》" },
    { "year": "1952", "title": "中国第一台蒸汽机制成" }
  ],
  "11-16": [
    { "year": "1892", "title": "中国革命家郭沫若出生" },
    { "year": "1981", "title": "中国女排首次获世界冠军" }
  ],
  "11-17": [
    { "year": "1887", "title": "英国占领埃及" },
    { "year": "1956", "title": "中国人民解放军铁道兵成立" }
  ],
  "11-18": [
    { "year": "1928", "title": "中国工农红军第四军成立" },
    { "year": "1986", "title": "《国际和平年宣言》签署" }
  ],
  "11-19": [
    { "year": "1831", "title": "比利时独立" },
    { "year": "1931", "title": "宁都起义" }
  ],
  "11-20": [
    { "year": "1904", "title": "中国革命家饶漱石出生" },
    { "year": "1979", "title": "中国与美国正式建交" }
  ],
  "11-21": [
    { "year": "1910", "title": "俄国文豪托尔斯泰逝世" },
    { "year": "1949", "title": "中国与印度建交" }
  ],
  "11-22": [
    { "year": "1890", "title": "法国画家凡·高自杀" },
    { "year": "1963", "title": "美国总统肯尼迪遇刺" }
  ],
  "11-23": [
    { "year": "1920", "title": "中国早期马克思主义者陈独秀被捕" },
    { "year": "1949", "title": "中国与缅甸建交" }
  ],
  "11-24": [
    { "year": "1859", "title": "英国生物学家达尔文《物种起源》出版" },
    { "year": "1966", "title": "中国第一颗导弹核武器试验成功" }
  ],
  "11-25": [
    { "year": "1902", "title": "中国革命家刘华出生" },
    { "year": "1950", "title": "中国与巴基斯坦建交" }
  ],
  "11-26": [
    { "year": "1832", "title": "法国总统戴高乐出生" },
    { "year": "1905", "title": "中国同盟会成立" }
  ],
  "11-27": [
    { "year": "1894", "title": "瑞典化学家诺贝尔逝世" },
    { "year": "1940", "title": "皖南事变爆发" }
  ],
  "11-28": [
    { "year": "1820", "title": "恩格斯出生" },
    { "year": "1987", "title": "中国首次直升机着舰试验成功" }
  ],
  "11-29": [
    { "year": "1930", "title": "中国革命根据地中央苏区成立" },
    { "year": "1947", "title": "石家庄解放" }
  ],
  "11-30": [
    { "year": "1939", "title": "苏芬战争爆发" },
    { "year": "1969", "title": "中国第一艘核潜艇下水" }
  ],
  "12-01": [
    { "year": "1927", "title": "中国革命根据地井冈山建立" },
    { "year": "1948", "title": "中国人民银行成立" }
  ],
  "12-02": [
    { "year": "1908", "title": "意大利国王遇刺" },
    { "year": "1949", "title": "中国与巴基斯坦建交" }
  ],
  "12-03": [
    { "year": "1863", "title": "中国革命家黄兴出生" },
    { "year": "1985", "title": "中国第一条地下铁道北京地铁通车" }
  ],
  "12-04": [
    { "year": "1892", "title": "中国革命家刘伯承出生" },
    { "year": "1991", "title": "中国完全消除票证制度" }
  ],
  "12-05": [
    { "year": "1870", "title": "法国革命家巴贝夫出生" },
    { "year": "1948", "title": "平津战役打响" }
  ],
  "12-06": [
    { "year": "1877", "title": "美国发明家爱迪生发明留声机" },
    { "year": "1957", "title": "中国第一个五年计划完成" }
  ],
  "12-07": [
    { "year": "1941", "title": "日本偷袭珍珠港" },
    { "year": "1976", "title": "中国成功进行氢弹试验" }
  ],
  "12-08": [
    { "year": "1856", "title": "中国革命家谭嗣同出生" },
    { "year": "1941", "title": "中国正式对日本宣战" }
  ],
  "12-09": [
    { "year": "1928", "title": "中国革命根据地瑞金建立" },
    { "year": "1958", "title": "黄河三门峡截流工程完工" }
  ],
  "12-10": [
    { "year": "1901", "title": "首届诺贝尔奖颁发" },
    { "year": "1948", "title": "联合国通过《世界人权宣言》" }
  ],
  "12-11": [
    { "year": "1915", "title": "袁世凯称帝" },
    { "year": "1996", "title": "中国第一架自主研制的喷气式飞机首飞" }
  ],
  "12-12": [
    { "year": "1936", "title": "西安事变爆发" },
    { "year": "1979", "title": "中国与美国正式建交" }
  ],
  "12-13": [
    { "year": "1937", "title": "南京大屠杀" },
    { "year": "1984", "title": "中国首次南极考察队抵达南极" }
  ],
  "12-14": [
    { "year": "1546", "title": "丹麦天文学家第谷出生" },
    { "year": "1984", "title": "中国首次南极洲考察站建成" }
  ],
  "12-15": [
    { "year": "1832", "title": "法国作家埃菲尔出生" },
    { "year": "1948", "title": "淮海战役胜利结束" }
  ],
  "12-16": [
    { "year": "1770", "title": "贝多芬出生" },
    { "year": "1920", "title": "中国共产党早期组织成立" }
  ],
  "12-17": [
    { "year": "1903", "title": "莱特兄弟首次飞机试飞" },
    { "year": "1935", "title": "一二·九运动爆发" }
  ],
  "12-18": [
    { "year": "1882", "title": "中国革命家蔡锷出生" },
    { "year": "1978", "title": "中国共产党十一届三中全会召开" }
  ],
  "12-19": [
    { "year": "1912", "title": "中国第一次南北议和" },
    { "year": "1984", "title": "中国第一个南极考察站长城站建成" }
  ],
  "12-20": [
    { "year": "1917", "title": "苏联成立" },
    { "year": "1999", "title": "中国政府对澳门恢复行使主权" }
  ],
  "12-21": [
    { "year": "1879", "title": "斯大林出生" },
    { "year": "1935", "title": "遵义会议召开" }
  ],
  "12-22": [
    { "year": "1880", "title": "中国革命家李大钊出生" },
    { "year": "1983", "title": "中国第一台亿次计算机研制成功" }
  ],
  "12-23": [
    { "year": "1888", "title": "中国革命家陈独秀出生" },
    { "year": "1949", "title": "中国与蒙古人民共和国建交" }
  ],
  "12-24": [
    { "year": "1818", "title": "英国小说家艾米莉·勃朗特出生" },
    { "year": "1956", "title": "中国第一辆汽车试制成功" }
  ],
  "12-25": [
    { "year": "1876", "title": "中国革命家刘少奇出生" },
    { "year": "1946", "title": "国民政府还都南京" }
  ],
  "12-26": [
    { "year": "1893", "title": "毛泽东出生" },
    { "year": "1932", "title": "中国工农红军第四方面军成立" }
  ],
  "12-27": [
    { "year": "1831", "title": "英国物理学家法拉第证明电磁感应" },
    { "year": "1930", "title": "中国工农红军第一方面军成立" }
  ],
  "12-28": [
    { "year": "1895", "title": "中国革命家朱德出生" },
    { "year": "1929", "title": "古田会议召开" }
  ],
  "12-29": [
    { "year": "1899", "title": "中国革命家聂荣臻出生" },
    { "year": "1968", "title": "中国南京长江大桥建成通车" }
  ],
  "12-30": [
    { "year": "1863", "title": "俄国作家契诃夫出生" },
    { "year": "1945", "title": "中国民主建国会成立" }
  ],
  "12-31": [
    { "year": "1916", "title": "袁世凯复辟帝制失败" },
    { "year": "1946", "title": "中国开始使用公历" }
  ]
};